Repository: zibuyu2015831/LangoTrace
Catalog: Packages/LangoTraceUI/Sources/LangoTraceUI/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, zh_hans

# settings.sync.detail
source: Entries, photos, memory indexes, and credentials stay out of sync until you choose a sync provider and confirm the scope.
zh_hans: 选择同步 Provider 并确认范围前，记录、照片、记忆索引和凭证都不会参与同步。

# settings.sync.summary
source: Sync is off. Your current content stays on this device.
zh_hans: 同步已关闭，当前内容保留在本机。

# settings.value.aiProvider.configured
source: Configured
zh_hans: 已配置

# settings.value.aiProvider.missingKey
source: Key missing
zh_hans: 缺密钥

# settings.value.aiProvider.notConfigured
source: Not set up
zh_hans: 未配置

# settings.value.aiProvider.partial
source: Partly ready
zh_hans: 部分可用

# settings.value.localData.computing
source: Calculating…
zh_hans: 计算中…

# settings.value.sync.notEnabled
source: Off
zh_hans: 未启用

# syncSettings.badge.advanced
source: Advanced
zh_hans: 高级

# syncSettings.badge.recommended
source: Recommended
zh_hans: 推荐

# syncSettings.future.body
source: WebDAV, local folder sync, and an official hosted sync service remain future adapter paths. This page does not treat sync as backup or export.
zh_hans: WebDAV、本地文件夹同步和官方托管同步服务仍是后续 Adapter 路径。本页不会把同步等同于备份或导出。

# syncSettings.future.title
source: Future paths
zh_hans: 后续路径

# syncSettings.iCloudPreview.body
source: This path is designed for iPhone, iPad, and Mac. The technical candidate is a CloudKit private database adapter behind the Sync Engine.
zh_hans: 这一路径面向 iPhone、iPad 和 Mac。技术候选是 Sync Engine 后方的 CloudKit private database Adapter。

# syncSettings.iCloudPreview.boundary.body
source: The current preview does not check Apple Account status, create a CloudKit container, write records, or upload content.
zh_hans: 当前预览不会检查 Apple Account 状态，不会创建 CloudKit container，不会写入记录，也不会上传内容。

# syncSettings.iCloudPreview.boundary.title
source: Preview boundary
zh_hans: 预览边界

# syncSettings.iCloudPreview.checklist.body
source: Real sync still needs iCloud capability, a CloudKit container, a private record zone, background behavior, quota handling, retry policy, and conflict recovery.
zh_hans: 真实同步仍需要 iCloud capability、CloudKit container、private record zone、后台行为、配额处理、重试策略和冲突恢复。

# syncSettings.iCloudPreview.checklist.title
source: Before real sync
zh_hans: 真实接入前

# syncSettings.iCloudPreview.close
source: Back to sync settings
zh_hans: 返回同步设置

# syncSettings.iCloudPreview.navigationTitle
source: iCloud Sync
zh_hans: iCloud 同步

# syncSettings.iCloudPreview.title
source: Apple device sync
zh_hans: Apple 设备同步

# syncSettings.method.iCloud.action
source: Preview iCloud sync
zh_hans: 预览 iCloud 同步

# syncSettings.method.iCloud.summary
source: Best for iPhone, iPad, and Mac. Uses your Apple Account and iCloud storage after the CloudKit adapter is implemented.
zh_hans: 适合 iPhone、iPad 和 Mac。CloudKit Adapter 接入后将使用你的 Apple Account 和 iCloud 存储。

# syncSettings.method.iCloud.title
source: iCloud Sync
zh_hans: iCloud 同步

# syncSettings.method.s3.action
source: Configure object storage
zh_hans: 配置对象存储

# syncSettings.method.s3.summary
source: For AWS S3, Cloudflare R2, MinIO, or a custom S3-compatible endpoint. This is an advanced local draft only.
zh_hans: 适合 AWS S3、Cloudflare R2、MinIO 或自定义 S3-compatible endpoint。当前只是高级本机草稿。

# syncSettings.method.s3.title
source: S3-compatible object storage
zh_hans: S3 兼容对象存储

# syncSettings.methods.title
source: Sync method
zh_hans: 同步方式

# syncSettings.mockBoundary.body
source: This is a real-grade settings preview. It does not connect to iCloud, S3, R2, WebDAV, a database, or secure credential storage, and it does not upload content.
zh_hans: 这是同步设置的真实级预览。当前不会连接 iCloud、S3、R2、WebDAV、数据库或安全凭证存储，也不会上传内容。

# syncSettings.mockBoundary.title
source: No cloud action yet
zh_hans: 当前不连接云端

# syncSettings.s3.close
source: Back to sync settings
zh_hans: 返回同步设置

# syncSettings.s3.connection.title
source: Connection draft
zh_hans: 连接草稿

# syncSettings.s3.header.body
source: Create a local preview for AWS S3, Cloudflare R2, MinIO, or a custom endpoint. Credentials are not saved or tested in this version.
zh_hans: 为 AWS S3、Cloudflare R2、MinIO 或自定义 endpoint 创建本机预览。本版本不会保存或测试凭证。

# syncSettings.s3.header.title
source: Object storage draft
zh_hans: 对象存储草稿

# syncSettings.s3.https.title
source: Require HTTPS
zh_hans: 要求 HTTPS

# syncSettings.s3.navigationTitle
source: Object Storage
zh_hans: 对象存储

# syncSettings.s3.provider.picker
source: Object storage provider
zh_hans: 对象存储 Provider

# syncSettings.s3.secretKey.hide
source: Hide Secret Access Key
zh_hans: 隐藏 Secret Access Key

# syncSettings.s3.secretKey.placeholder
source: Local draft only
zh_hans: 仅本机草稿

# syncSettings.s3.secretKey.show
source: Show Secret Access Key
zh_hans: 显示 Secret Access Key

# syncSettings.s3.security.body
source: Use a dedicated bucket or prefix and least-privilege credentials. The current draft does not save secrets, write secure storage, test the connection, or upload life records.
zh_hans: 请使用专用 bucket 或 prefix，并配置最小权限凭证。当前草稿不会保存密钥、写入安全存储、测试连接或上传生活记录。

# syncSettings.s3.security.title
source: Credential boundary
zh_hans: 凭证边界

# syncSettings.s3.validation.complete
source: Draft fields complete
zh_hans: 草稿字段完整

# syncSettings.s3.validation.missing
source: Required fields missing
zh_hans: 必填字段缺失

# syncSettings.scope.aiGeneratedContent.summary
source: Generated study material can be included when sync is implemented.
zh_hans: 真实同步接入后，AI 生成的学习材料可进入同步范围。

# syncSettings.scope.aiGeneratedContent.title
source: AI generated content
zh_hans: AI 生成内容

# syncSettings.scope.audioAttachments.summary
source: Audio can contain sensitive life context and consume more cloud storage.
zh_hans: 音频可能包含更敏感的生活语境，也会占用更多云端空间。

# syncSettings.scope.audioAttachments.title
source: Audio attachments
zh_hans: 音频附件

# syncSettings.scope.credentials.summary
source: AI keys, object storage secrets, and recovery keys never enter sync data.
zh_hans: AI Key、对象存储密钥和恢复密钥永不进入同步数据。

# syncSettings.scope.credentials.title
source: Keys and credentials
zh_hans: 密钥与凭证

# syncSettings.scope.learningProgress.summary
source: Learning material, practice history, and progress are stable sync candidates.
zh_hans: 学习材料、练习历史和进度属于稳定同步候选。

# syncSettings.scope.learningProgress.title
source: Learning material and progress
zh_hans: 学习材料和进度

# syncSettings.scope.lifeEntries.summary
source: Your written life records are the primary sync data after you enable a real adapter.
zh_hans: 真实 Adapter 启用后，你写下的生活记录会是主要同步数据。

# syncSettings.scope.lifeEntries.title
source: Life records
zh_hans: 生活记录

# syncSettings.scope.photoAttachments.summary
source: Photos are optional because they can be private and large.
zh_hans: 照片可能更私密且体积更大，因此默认不进入同步。

# syncSettings.scope.photoAttachments.title
source: Photo attachments
zh_hans: 照片附件

# syncSettings.scope.promptPresets.summary
source: Non-sensitive preset settings can follow your devices; provider secrets do not.
zh_hans: 非敏感 Prompt Preset 设置可以跟随设备，Provider 密钥不会同步。

# syncSettings.scope.promptPresets.title
source: Prompt Presets
zh_hans: Prompt Preset

# syncSettings.scope.state.included
source: Included
zh_hans: 可同步

# syncSettings.scope.state.localOnly
source: Local only
zh_hans: 仅本机

# syncSettings.scope.state.localRebuild
source: Rebuild locally
zh_hans: 本地重建

# syncSettings.scope.state.offByDefault
source: Default off
zh_hans: 默认关闭

# syncSettings.scope.title
source: Sync scope
zh_hans: 同步范围

# syncSettings.scope.vectorIndex.summary
source: Vector indexes are derived data and should be rebuilt on each device.
zh_hans: 向量索引是派生数据，应在每台设备本地重建。

# syncSettings.scope.vectorIndex.title
source: Vector index
zh_hans: 向量索引

# syncSettings.status.previewOnly
source: Preview only
zh_hans: 仅预览

# syncSettings.status.summary
source: Data stays on this device. Enabling real sync later will only include the content you choose, and conflicts will preserve versions instead of silently overwriting them.
zh_hans: 数据仍保存在这台设备。后续真实启用同步时，只会同步你选择的内容；发生冲突时会优先保留版本，而不是静默覆盖。

# syncSettings.status.title
source: Data stays local
zh_hans: 数据保留在本机

# tab.reading
source: Reading
zh_hans: 阅读

# timeline.empty.body
source: Start recording a life moment to create your first entry.
zh_hans: 记录一个生活瞬间，开始你的第一条记录。

# timeline.empty.title
source: No entries yet
zh_hans: 暂无记录

# timeline.filter.empty.body
source: Try a different filter.
zh_hans: 试试其他筛选条件。

# timeline.filter.empty.title
source: No matching entries
zh_hans: 筛选暂无结果

# timeline.section.today
source: Today
zh_hans: 今天

# timeline.section.yesterday
source: Yesterday
zh_hans: 昨天

# unavailable.generic.nextRequirement
source: Connect the real capability only after its module plan and worklog are complete.
zh_hans: 在对应模块完成方案和 worklog 后再接入真实能力。

# unavailable.generic.summary
source: This action needs more setup before it becomes part of the main workflow.
zh_hans: 这个操作需要完成更多配置后再进入主流程。

# unavailable.generic.title
source: Needs Setup
zh_hans: 需要配置

# unavailable.importExport.nextRequirement
source: Finish the local library model, attachment handling, file access rules, and export format design.
zh_hans: 完成本地资料库模型、附件处理、文件访问规则和导出格式设计。

# unavailable.importExport.summary
source: The current build will not open file panels, read disk files, write export packages, or access attachment folders.
zh_hans: 当前不会打开文件面板、读取磁盘文件、写入导出包或访问附件目录。

# unavailable.importExport.title
source: Import and Export Planned
zh_hans: 导入导出规划中

# unavailable.languageSpace.nextRequirement
source: Complete language space persistence, recent-space restore, and the multi-space selection UI.
zh_hans: 完成语言空间持久化、最近使用空间恢复和多空间选择 UI。

# unavailable.languageSpace.summary
source: The current build starts with one language space. Multi-space creation and switching will be added later.
zh_hans: 当前版本先从一个语言空间开始，后续会加入多空间创建和切换。

# unavailable.languageSpace.title
source: Language Space Switching Planned
zh_hans: 语言空间切换规划中

# unavailable.nextRequirement.title
source: Next Step
zh_hans: 接下来

# unavailable.noSideEffects.body
source: Nothing is sent, recorded, imported, exported, or changed when this page opens.
zh_hans: 打开本页不会发送、录音、导入、导出或修改内容。

# unavailable.noSideEffects.title
source: Privacy Note
zh_hans: 隐私说明

# unavailable.photoWriting.nextRequirement
source: Connect PhotosUI, OCR / Vision, attachment storage, request preview, and a user confirmation flow.
zh_hans: 接入 PhotosUI、OCR / Vision、附件存储、请求预览和用户确认流程。

# unavailable.photoWriting.summary
source: This page only closes the entry loop. It will not access the photo library or start OCR or AI generation.
zh_hans: 当前页面只补齐入口反馈，不访问照片库，也不会启动 OCR 或 AI 生成。

# unavailable.photoWriting.title
source: Photo Writing Planned
zh_hans: 照片写作规划中

# unavailable.search.nextRequirement
source: Finish local search, phrase indexing, and result routing.
zh_hans: 完成本地搜索、词句索引和结果路由。

# unavailable.search.summary
source: Search will cover your life entries and learning material. Opening this page does not query or send content.
zh_hans: 搜索将覆盖生活记录和学习材料。打开本页不会查询或发送内容。

# unavailable.search.title
source: Search Planned
zh_hans: 搜索规划中

# unavailable.vectorIndex.nextRequirement
source: Finish local memory indexing, provider configuration, rebuild rules, and sync exclusion boundaries.
zh_hans: 完成本地记忆索引、Provider 配置、重建规则和同步排除边界。

# unavailable.vectorIndex.summary
source: Memory search will be rebuilt from your local life entries when enabled.
zh_hans: 开启后，记忆搜索会从本地生活记录重建。

# unavailable.vectorIndex.title
source: Memory Search Planned
zh_hans: 记忆搜索规划中

# welcome.localOnlyNote
source: Continue when you are ready. This screen does not start AI, sync, or online transfer.
zh_hans: 准备好后再继续。本页不会启动 AI、同步或在线传输。

# welcome.tracePreview.examples.cafe.rewrittenText
source: 这杯咖啡可以帮我打包吗？
zh_hans: Could I get this coffee to go, please?

# welcome.tracePreview.examples.commute.rewrittenText
source: 地铁晚点了，我需要确认一下要不要换站台。
zh_hans: The train is delayed, so I should check whether I need to change platforms.

# welcome.tracePreview.examples.meeting.rewrittenText
source: 今天会议上，我想确认截止时间，并明确下一步由谁负责。
zh_hans: In today’s meeting, I wanted to confirm the deadline and clarify who would own the next step.

# welcome.tracePreview.expressionTitle
source: Expression
zh_hans: 表达

# welcome.tracePreview.practiceTitle
source: Practice
zh_hans: 练习

# welcome.tracePreview.vocabularyTitle
source: Vocabulary
zh_hans: 词汇

# companion.recast.toggle
source: Gentle recast
zh_hans: 温和复述
